{
  "title": "Cookies & Cache",
  "overview": "As a private eye, you often get hired to look into things the police usually won’t...\n[full overview text goes here]",
  "settings": [
    {
      "name": "Outside a dock house like in San Francisco",
      "interactables": [
        "Locked door (player needs a crowbar to open the door)",
        "Tire tracks (showcases the truck did leave the warehouse)",
        "Searchable dumpster (Contains crowbar needed to jam open door)"
      ]
    },
    {
      "name": "Inside the dock house facing towards the door",
      "interactables": [
        "Shipping terminal (needs password. Shows where the scheduled shipment was supposed to go...)",
        "Sticky note left on computer (contains login information)",
        "Digital truck scale (logs of the weight of the trucks...)",
        "Hallway (leads to the back half of the warehouse)"
      ]
    },
    {
      "name": "Inside the dock house facing towards the back",
      "interactables": [
        "Hallway (leads to the front half of the warehouse)",
        "Office (contains more clues in the next room)"
      ]
    },
    {
      "name": "Inside the office",
      "interactables": [
        "Filing cabinets (written report on the amount of guns...)",
        "Photograph on the desk (has a date written on it)",
        "Computer on the desk (player can log into the email...)",
        "Email exchange (turncoat revealed planning to sell weapons)"
      ]
    }
  ],
  "key_point": "The weapons never left the warehouse (hence the light truck and the selling plan).",
  "choices": [
    {
      "text": "Do as Hired. Report back to the gang the information you have found.",
      "result": "The DeadLock Crew nods and pays up. What they do with the traitor? Not your problem.",
      "tip": "Sometimes doing the job means ignoring the fallout. Don’t mistake loyalty for safety."
    },
    {
      "text": "Good Citizen. Report the weapon shipment/turncoat information to the police.",
      "result": "Anonymous tips lead to sirens in the night. You watch from the shadows, conscience clean.",
      "tip": "Doing the right thing doesn't always mean staying safe — but at least you sleep better."
    },
    {
      "text": "Sellout. Sell the information to a rival gang, enabling them to steal the shipment.",
      "result": "You get your payday — and they get the drop. The dock never sees another shipment again.",
      "tip": "When money talks, morals walk. But blood has a way of finding its way back to your door."
    }
  ],
  "dialogue": ["c2_d0", "c2_d1", "c2_d2", "c2_d3"]
}
