{
  "title": "Gone Phishing",
  "intro": "Another missing person. Seems more and more people are vanishing in this city. I doubt this case is going anywhere, but it's hard to tell a mother she’ll never see her child again. Luckily, she let me into her daughter's computer. Let’s hope something is buried in the bits.",
  "overview": "A potential kidnapping, a trail of digital footprints, and a desperate mother. The daughter’s computer is the only lead.",
  "settings": [
    {
      "name": "Desktop Computer",
      "interactables": [
        "Email app (leads to email inbox)",
        "Social media app (leads to social media page)",
        "Trash bin (leads to deleted files)",
        "Internet browser (shows search history)"
      ]
    },
    {
      "name": "Email Inbox",
      "interactables": [
        "Phishing email pretending to be from Emily",
        "Spring Fashion advertisement spam",
        "Message from Sarah about group project",
        "ClickClock storage upgrade upsell",
        "Professor’s funeral notice",
        "NuSkin product spam with aggressive sale pitch"
      ]
    },
    {
      "name": "Social Media Profile",
      "interactables": [
        "Terms of Service (humorous but creepy data-harvesting clause)",
        "Friends list (no sign of recent invite from Emily)",
        "Post history with a visible geolocation tag"
      ]
    },
    {
      "name": "Internet Browser",
      "interactables": [
        "Search: how to tell if my computer has a virus",
        "Search: how check for computer virus",
        "Search: do i have a virus",
        "Search: How to tell if I downloaded a virus?",
        "Search: why is my computer acting weird",
        "Search: how to unsubscribe from emails",
        "Search: fake nails cheap",
        "Search: BeeBeauty spring sale",
        "Search: NuSkin skin smoother paste",
        "Search: Zoom.com"
      ]
    },
    {
      "name": "Trash Bin",
      "interactables": [
        "Image file (vacation-pic.jpg)",
        "Folder labeled Memories",
        "zoom_installer_x64.exe (possibly malicious)",
        "Mysterious file (data3xf1ltrat3.bat)",
        "PDF of chemistry lab (Lab-6b-common-reactions.pdf)"
      ]
    }
  ],
  "dialogue": ["c2_d0", "c2_d1", "c2_d2", "c2_d3"],
  "choices": [
    {
      "text": "Sugar coat the truth.",
      "result": "You soften the blow. There’s hope — the computer shows a location the police might use to track the kidnapper.",
      "tip": "Be cautious when accessing public email — phishing can look shockingly legitimate."
    },
    {
      "text": "Don't sugar coat the truth.",
      "result": "You tell it straight: the spyware traced her. Recovery chances are slim. It’s likely too late.",
      "tip": "Once spyware is installed, it can monitor everything. Prevention is your best defense."
    }
  ],
  "tip": "Protection against malware is proactive, not reactive. Once it gets into the system, you've already lost.",
  "key_point": "Hannah clicked a phishing email. The spyware tracked her social media geolocation posts. The kidnapper used that data to plan and execute the abduction."
}
